app/controllers/restaurants_controller.rb

    def index
      restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

    def show
      restaurant = Restaurant.find_by(id: params[:id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
      restaurant = Restaurant.new(restaurant_params)
      if restaurant.save
---
INSERT INTO "restaurants" ("name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Sottocasa NYC"], ["address", "298 Atlantic Ave, Brooklyn, NY 11201"], ["created_at", "2023-06-25 17:51:33.600482"], ["updated_at", "2023-06-25 17:51:33.600482"]]

    def destroy
      restaurant = Restaurant.find_by(id: params[:id])

      if restaurant
        restaurant.restaurant_pizzas.destroy_all
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "restaurant_pizzas" WHERE "restaurant_pizzas"."id" = ?  [["id", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 1]]