app/controllers/restaurant_pizzas_controller.rb

    def create
      restaurant_pizza = RestaurantPizza.new(restaurant_pizza_params)

      if restaurant_pizza.save
---
INSERT INTO "restaurant_pizzas" ("restaurant_id", "pizza_id", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["restaurant_id", 3], ["pizza_id", 1], ["price", 5], ["created_at", "2023-06-25 17:06:56.266891"], ["updated_at", "2023-06-25 17:06:56.266891"]]

    def destroy
      restaurantpizza = RestaurantPizza.find(params[:id])
---
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]